/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   yellow_warning.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tjinichi <tjinichi@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/17 22:17:29 by tjinichi          #+#    #+#             */
/*   Updated: 2020/12/17 22:18:11 by tjinichi         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../includes/write_func.h"

/*
** [Warning]を黄色文字(\033[33m)・太文字(\033[1m)で出す関数
*/

void	yellow_warning(void)
{
	write(1, "\033[33m\033[1m[Warning]\033[0m\n", 23);
}
